package com.example.cooking;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;

import java.util.ArrayList;
import java.util.List;

public class FrenchActivity extends AppCompatActivity {
    List<Dish> dishes = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_french);

        RecyclerView recyclerView = findViewById(R.id.list_dish);

        setInitialData();

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        DishAdapter adapter = new DishAdapter(this, FrenchActivity.this, dishes);
        recyclerView.setAdapter(adapter);


        findViewById(R.id.buttonBack).setOnClickListener(v -> {
            startActivity(new Intent(FrenchActivity.this, MainActivity.class));
            finish();
        });
    }

    private void setInitialData() {

        dishes.add(new Dish("Французская", "Сырный суп по-французски с курицей", "Сырный суп с сухариками.\n", "Куриное филе - 500 г.\n" + "Плавленый сыр - 200 г.\n" + "Картофель - 400 г.\n" + "Лук - 150 г.\n" + "Морковь - 180 г.\n" + "Сливочное масло - по вкусу.\n" + "Соль - по вкусу.\n" + "Молотый черный перец - по вкусу.\n" + "Зелень - по вкусу.\n" +
                "Лавровый лист - 3 шт.\n" + "Гренки - по вкусу.\n" + "Черный перец горошком - 2 шт.\n", "1 час\n", "В кастрюлю на 3 литра положить мясо и налить воды. Как только бульон начнет кипеть, добавить 1 чайную ложку соли, пару горошков душистого перца и черного, 2–3 листика лаврового листа. Варить от момента закипания 20 минут. Затем мясо вынуть.\n" +
                "Картофель почистить и нарезать кубиками. Лук нарезать кубиками. Морковь натереть на терке. Мясо порезать небольшими кусочками. Плавленый сыр (если в виде брусочка) натереть на терке или порезать кубиками.\n" + "В кипящий бульон добавить картофель. С момента закипания 5–7 минут.\n" + "В это время сделать слабую зажарку на сливочном масле. Сначала положить лук, затем морковь. Слегка посолить и поперчить. Готовую зажарку добавить в суп и варить еще 5–7 минут.\n" +
                "Затем добавить порезанное мясо. Варить 3–4 минуты, добавить плавленый сыр, хорошенько помешать и выключить огонь.\n" + "Перед подачей посыпать зеленью. По желанию подавать с гренками.\n", R.drawable.cheese_soup));

        dishes.add(new Dish("Французская", "Маффины с голубикой и мускатным орехом", "Маффины с голубикой (да и не только с этой ягодой) стали популярным десертом в Англии и Америке, хотя происхождение их французское.\n", "Сливочное масло - 110 г.\n" + "Пшеничная мука - 290 г.\n" + "Разрыхлитель - 2 ч. л.\n" + "Соль - щепотка.\n" + "Сахар - 250 г.\n" + "Голубика - 1 ст.\n" + "Куриное яйцо - 2 шт.\n" + "Ванильный экстракт - 2 ч. л.\n" +
                "Молоко - 120 мл.\n" + "Мускатный орех - 0,25 ч . л.\n", "35 мин\n", "Форму для маффинов смазать маслом и посыпать мукой.\n" + "Венчиком смешать муку, соль, разрыхлитель. Голубику обвалять в двух чайных ложках мучной смеси.\n" +
                "Миксером на средней скорости взбить сливочное масло с сахаром (200 грамм). Займет это примерно четыре-пять минут. Затем по одному добавить яйца, потом — ваниль.\n" + "Переключить миксер на самый медленный режим, всыпать муку, размешать и постепенно влить молоко. Размешивать надо, пока тесто не станет более-менее сходиться, тогда маффины получатся нежными и рыхлыми. Лопаточкой вмешать голубику.\n" + "Разложить тесто в формочки. Оставшиеся 50 грамм сахара смешать с тертым мускатным орехом и посыпать шапки маффинов.\n" +
                "Поставить будущие маффины в разогретую до 190 градусов духовку и продержать в ней примерно двадцать пять минут.\n", R.drawable.maffins));

        dishes.add(new Dish("Французская", "Суп вишисуаз", "Вишисуаз — это традиционный парижский суп из порея, картошки и сливок, превращенный в пюре и поданный холодным с гарниром из рубленого зеленого лука и прочим, что нашлось в доме.\n", "Лук-порей - 500 г.\n" + "Картофель - 500 г.\n" + "Репчатый лук - 1 шт.\n" + "Зеленый лук - 50 г.\n" + "Куриный бульон - 1 л.\n" + "Сливочное масло - 100 г.\n" + "Соль - по вкусу.\n" + "Сливки - 200 мл.\n" + "Молотый черный перец - по вкусу.\n", "40 мин\n",
                "Растопить сливочное масло в глубокой кастрюле, добавить мелко нарубленный репчатый лук и обжарить до мягкости.\n" + "Добавить мелко нарубленный лук-порей и обжаривать до мягкости теперь уже порея. После чего очищенный картофель, нарезанный мелкими кубиками, и бульон. Довести до кипения, посолить, поперчить и варить на медленном огне полчаса.\n" +
                        "Готовый суп взбить в блендере вместе с холодными сливками до нежного пюреобразного состояния. Для пущей нежности можно протереть суп через мелкое сито. Охладить и подавать, посыпав мелко нарубленным зеленым луком. Во французской традиции вишисуаз часто подают с салатом из слегка обжаренных с чесноком креветок и мелко нарубленного фенхеля, смешанного с лимонным соком и оливковым маслом.\n" + "Еще один вариант гарнира — нарубленные мелкими кубиками огурцы с зеленым луком и сметаной. Огурцы для такого салата лучше предварительно очистить от кожицы, чтобы их нежная, беззащитная текстура сливалась с кремовой текстурой супа.\n", R.drawable.vishisuaz));

        dishes.add(new Dish("Французская", "Киш лорен со шпинатом", "Гастрономический топоним французской кухни (что крайняя редкость) — лотарингский открытый пирог с формой из слоеного теста, куда кладутся слегка обжаренная ветчина и лук и заливается яично-сырная смесь.\n", "Говяжья грудинка - 250 г.\n" + "Шпинат - 200 г.\n" + "Сыр конте - 100 г.\n" + "Морковь - 1 шт.\n" + "Молоко - 100 мл.\n" + "Сметана 35%-ная - 200 г.\n" + "Мускатный орех - щепотка.\n" + "Пшеничная мука - 250 г.\n" + "Куриное яйцо - 4 шт.\n" + "Сливочное масло - 125 г.\n" + "Яичный желток - 1 шт.\n" + "Вода - 2 ст. л.\n" + "Соль - по вкусу.\n" + "Молотый черный перец - по вкусу.\n", "50 мин\n",
                "Грудинку и морковь нарезать средними кубиками. Шпинат вымыть и крупно нарезать. Сыр натереть на крупной терке.\n" + "На раскаленной сковороде слегка обжарить грудинку, добавить нарезанную морковь и продолжать обжаривать на среднем \u00ADогне до готовности моркови. Добавить шпинат, снять с огня и закрыть крышкой.\n" + "Просеять муку, сливочным маслом, солью и растереть руками до состояния крошки. Добавить яичный желток, перемешать, постепенно влить холодную воду (примерно две столовые ложки) и тщательно вымесить. Убрать в холодильник на 30 минут. Раскатать тесто, переложить в форму с бортиками.\n" +
                        "В миске смешать половину натертого сыра, сметану, молоко, яйца, приправить, как следует перемешать. В миску добавить обжаренную грудинку с морковью и шпинатом, еще раз перемешать, влить в форму с подготовленным коржом, посыпать оставшимся сыром и выпекать при температуре 180 градусов тридцать минут.\n", R.drawable.kish));

        dishes.add(new Dish("Французская", "Шоколадный капкейк с кремом ганаш", "Кофе подчеркивает вкус горького шоколада, придает капкейку аппетитный и насыщенный цвет. А золото — можно попробовать раздобыть кондитерское сусальное — делает эти капкейки особенно нарядными и торжественными.\n", "Какао-порошок - 35 г.\n" + "Ванильный экстракт - 10 мл.\n" + "Свежесваренный кофе - 90 мл.\n" + "Пшеничная мука - 215 г.\n" + "Разрыхлитель - 0,5 ч. л.\n" + "Соль - 0,75 ч. л.\n" + "Сливочное масло - 170 г.\n" + "Сода - 0,5 ч. л.\n" + "Сахар - 215 г.\n" + "Куриное яйцо - 2 шт.\n" + "Сметана - 120 г.\n" + "Горький шоколад - 225 г.\n" + "Сливки 35%-ные - 270 мл.\n" + "Патока - 40 г.\n",
                "30 мин\n", "Венчиком перемешать какао, кофе и ванильный экстракт.\n" + "Таким же образом смешать муку, разрыхлитель, соду и соль.\n" + "Растопить в сотейнике масло и сахар, затем взбить миксером 5 минут, пока масса не остынет. Добавить по одному яйца, затем смесь какао и кофе. Всыпать туда же половину мучной смеси, размешать. Следующей добавить сметану, тоже размешать. И только потом — оставшуюся мучную смесь.\n" + "Разложить тесто по формочкам и отправить в разогретую до 175 градусов духовку минут на 20.\n" +
                "Довести сливки с патокой до кипения. Мелко нарубить шоколад, положить его в широкое блюдо и залить горячими сливками. Через 15–20 секунд плавящиеся кусочки аккуратно лопаткой размешать в абсолютно гомогенную массу — начинать надо с середины, постепенно захватывая все больше шоколада.\n" + "Поставить крем в холодильник и периодически помешивать, пока он не замерзнет настолько, что будет держать форму. Тогда выложить крем в кондитерский мешок и выдавить на готовые капкейки. Украсить кремовые купола золотистым драже.\n", R.drawable.capcake));
    }
}