package com.example.cooking;

import androidx.appcompat.app.AppCompatActivity;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;

import java.util.ArrayList;
import java.util.List;

public class ItalianActivity extends AppCompatActivity {
    List<Dish> dishes = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_italian);

        RecyclerView recyclerView = findViewById(R.id.list_dish);

        setInitialData();

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        DishAdapter adapter = new DishAdapter(this, ItalianActivity.this, dishes);
        recyclerView.setAdapter(adapter);


        findViewById(R.id.buttonBack).setOnClickListener(v -> {
            startActivity(new Intent(ItalianActivity.this, MainActivity.class));
            finish();
        });
    }

    private void setInitialData() {

        dishes.add(new Dish("Итальянская", "Спагетти карбонара со сливками", "Изобретенная когда-то простыми шахтерами, эта простая и сытная паста завоевала сердца и желудки многих.\n",
                "Спагетти - 250 г.\n" + "Сливочное масло - 20 г.\n" + "Чеснок - 2 зубчика.\n" + "Красный лук - 1 головка.\n" + "Бекон - 50 г.\n" + "Сливки 20%-ные - 50 г.\n" + "Тертый сыр пармезан - 50 г.\n" + "Куриное яйцо - 4 шт.\n" + "Соль - по вкусу.\n" + "Молотый черный перец - по вкусу.\n", "20 мин\n", "Вскипятите воду в большой кастрюле и сварите пасту до состояния аль денте. Обычно для этого нужно варить ее на минуту меньше, чем указано на пачке.\n" +
                "Пока паста варится, растопите на сковороде масло и обжарьте на нем мелко нарезанные лук, чеснок и бекон. До мягкости и до отчетливого чесночного и жаренобеконного запаха.\n" + "Снимите сковороду с огня и в глубокой миске взбейте четыре яичных желтка со сливками и тертым пармезаном. Посолите и поперчите смесь, еще раз взбейте.\n" +
                "В готовые спагетти вывалите обжаренные с луком и чесноком кусочки бекона. Влейте смесь сливок, желтков и пармезана, перемешайте. И сразу подавайте, посыпав свеженатертым сыром и черным молотым перцем.\n", R.drawable.carbonara));

        dishes.add(new Dish("Итальянская", "Лазанья", "Классическая лазанья с мясом", "Мясной фарш - 600 г.\n" + "Соус болоньезе - 600 г.\n" + "Сливочное масло - 60 г.\n" + "Пшеничная мука - 2,5 ст. л.\n" + "Оливковое масло - 2 ст. л.\n" + "Молоко - 750 мл.\n" + "Готовые сухие листы лазаньи - 10 шт.\n" + "Твердый сыр - 500 г.\n", "40 мин\n", "В сотейник положить сливочное масло и 2 ложки растительного масла, растопить. Постепенно добавлять муку и размешивать так, чтобы не оставалось комочков.\n" +
                "Когда вся мука вмешана, влить все молоко. Убавить огонь и томить до нужной консистенции: не жидкой, но и не слишком густой. Консистенция нежирной сметаны.\n" + "На сковороде раскалить оливковое масло. Добавить мясной фарш (лучше свинина+телятина).\n" + "Фарш жарить до полуготовности. Влить в него соус болоньезе, посолить и поперчить по вкусу.\n" + "Духовку разогреть до 180 градусов. Форму смазать сливочным маслом. На дно вылить немного соуса бешамель, чуть-чуть, только чтобы покрыть дно.\n" +
                "Выложить пласты (не вареные). На пласты выложить получившийся фарш (не жалеем!), на фарш — натертый сыр. На сыр — соус бешамель.\n" + "Соуса нужно выкладывать столько, сколько необходимо, на ваш взгляд, чтобы лазанья получилась сочной. Поверх соуса выложить сухие листы лазаньи. Повторить процедуру.\n" + "Последний слой листов промазать соусом бешамель и сверху щедро засыпать сыром. Дать постоять минут 7–10. Поставить в духовку. Печь 30 минут.\n", R.drawable.lazania));

        dishes.add(new Dish("Итальянская", "Брускетта с помидорами", "Брускетта с помидорами — вкусная итальянская закуска, а также простейший способ положить что-то на зуб, почувствовать легкую сытость, но обойтись при этом без переедания.\n", "Белый хлеб - 4 куска.\n" + "Помидоры - 3 шт.\n" + "Оливковое масло - 30 мл.\n" + "Чеснок - 3 зубчика.\n" + "Бальзамический крем - 10 г.\n" + "Свежемолотый черный перец - по вкусу.\n" + "Соль - по вкусу\n" + "Зелень - 30 г.\n", "10 мин",
                "Поджарить хлеб на сухой сковородке или в духовке до золотистой корочки. В духовке это займет три-пять минут (в зависимости от размера ломтя хлеба) при температуре 200 градусов.\n" + "Помидоры нарезать кубиками с ребром около полсантиметра. Мелко нарубить три зубчика чеснока.\n" + "Разогреть сковороду, плеснуть в нее немного оливкового масла и высыпать в него помидоры и чеснок. Готовить их минуту-другую, просто чтобы прогреть, не потеряв вкуса свежего помидора. Тогда капнуть в сковороду бальзамического крема, перемешать и снять с огня.\n" +
                        "Поджаренный хлеб пропитать оставшимся оливковым маслом, разлив понемногу на каждый ломоть. Сверху выложить теплые помидоры, посолить по вкусу, посыпать свежемолотым черным перцем и мелко нарезанной зеленью — любой, какая окажется под рукой. И подавать как закуску — например, к вину.\n", R.drawable.brusketta));

        dishes.add(new Dish("Итальянская", "Тонкое тесто для пиццы", "Наполнители вы выбираете сами, это рецепт только теста.\n", "Пшеничная мука - 175 г.\n" + "Соль - по вкусу.\n" + "Оливковое масло - 1 ст. л.\n" + "Сухие дрожжи - 1 ч. л.\n" + "Вода - 125 мл.\n", "1 час", "Соединить муку, соль и дрожжи в кухонном комбайне. Соединить в кувшине масло и воду. Не выключая комбайн, влить жидкость и замесить однородное тесто. Переложить на стол, посыпанный мукой и месить тесто 2-3 мин.\n" +
                "Переложить тесто в миску и смазать снаружи оливковым маслом. Накрыть миску пищевой пленкой и поставить в теплое место на 40 мин, пока тесто не увеличится в 2 раза.\n" + "Снова месить тесто 1-2 мин. Раскатать тесто в круг 30 см и положить на противень. Сдавить 2 см от края, чтобы получилась корочка и наполнить начинкой на ваш выбор.\n", R.drawable.pizza));

        dishes.add(new Dish("Итальянская", "Ризотто с шампиньонами", "Блюдо итальянской кухни из риса, с мягким, сливочным вкусом. Первое письменное упоминание о нём встречается только в XIX веке.\n", "Рис арборио - 300 г.\n" + "Сливочное масло - 100 г.\n" + "Репчатый лук - 1 головка.\n" + "Белое сухое вино - 200 мл.\n" + "Куриный бульон - 1 л.\n" + "Шампиньоны - 300 г.\n" + "Соль - по вкусу.\n" + "Шафран - щепотка.\n", "40 мин\n", "Лук мелко нарезать и обжаривать в сотейнике на сливочном масле до тех пор, пока лук не начнет пахнуть жареным, добавить мелко нарезанные шампиньоны, обжарить их, пока не выпустят воду. Тогда всыпать в сотейник рис и обжаривать его вместе с луком и грибами две минуты, постоянно помешивая.\n" +
                "Залить рис и лук куриным бульоном и вином. Варить без крышки, постоянно помешивая. Когда бульон и вино выпарятся наполовину, добавить крошечную щепотку шафрана, посолить. Помешивая, варить, пока рис не приготовится. Если жидкость выкипит слишком рано, долить воды, вина или бульона.\n", R.drawable.rizotto));
    }
}