package com.example.cooking;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;

import java.util.ArrayList;
import java.util.List;

public class RussianActivity extends AppCompatActivity {
    List<Dish> dishes = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_russian);

        RecyclerView recyclerView = findViewById(R.id.list_dish);

        setInitialData();

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        DishAdapter adapter = new DishAdapter(this, RussianActivity.this, dishes);
        recyclerView.setAdapter(adapter);


        findViewById(R.id.buttonBack).setOnClickListener(v -> {
            startActivity(new Intent(RussianActivity.this, MainActivity.class));
            finish();
        });
    }

    private void setInitialData() {

        dishes.add(new Dish("Русская", "Борщ", "Вкусный красный борщ с говядиной приготовить очень легко.\n", "Говядина - 500 г\n" + "Свёкла - 1 шт.\n" + "Картофель - 2 шт.\n" +
                "Капуста белокочанная - 200 г\n" + "Морковь - 1 шт.\n" + "Лук репчатый - 1 шт.\n" + "Томатная паста - 1 ст. ложка\n" + "Масло растительное - 2 ст. ложки\n" + "Уксус - 1 ч. ложка\n" +
                "Лавровый лист - 1 шт.\n" + "Перец чёрный горошком - 2-3 шт.\n" + "Соль - 2 ч. ложки (по вкусу)\n" + "Вода - 1,5 л\n" + "Зелень укропа и/или петрушки (для подачи) - 3-4 веточки\n" + "Сметана (для подачи) - 2 ст. ложки\n",
                "2 часа\n", "Сварить мясной бульон.\n" + "Свеклу, морковь, петрушку и лук нарезать соломкой, положить в суповую кастрюлю, добавить помидоры или томат-пюре, уксус, сахар и немного бульона с жиром (или добавить 1-2 ст. ложки масла), закрыть крышкой и поставить овощи тушить. Овощи перемешивать, чтобы не пригорели, прибавляя, если нужно, немного бульона или воды.\n" +
                "Через 15-20 минут добавить нашинкованную капусту, все перемешать и тушить еще 20 минут.\n" + "Затем овощи залить подготовленным мясным бульоном, положить перец, лавровый лист, соль, добавить по вкусу немного уксуса и варить до полной готовности овощей. При подаче на стол в борщ положить сметану.\n" +
                "В борщ при варке добавляют картофель в целом виде или нарезанный дольками, а также свежие помидоры. Их также нарезают дольками и кладут в борщ за 5-10 минут до окончания варки. В готовый борщ кроме мяса можно положить вареную ветчину, сосиски или колбасу.\n" +
                "Для подкрашивания борща можно сделать свекольный настой. Для этого одну свеклу нарезать ломтиками, залить стаканом горячего бульона, добавить чайную ложку уксуса и поставить на 10-15 минут на слабый огонь и довести до кипения. После этого настой процедить и влить в борщ перед подачей на стол.\n", R.drawable.borscht));

        dishes.add(new Dish("Русская", "Макароны по-флотски", "Макароны по-флотски - классическое блюдо советской домашней кухни.\n", "Макароны – 300 г.\n" + "Говяжий фарш – 600 г.\n" + "Паста томатная – 2 ст. л..\n" +
                "Масло растительное – 2 ст. л..\n" + "Лук – 1 шт..\n" + "Толченый чеснок – 2 зубчика.\n" +
                "Соль – по вкусу.\n", "30 мин\n", "Лук и чеснок мелко нарезать. В сковороде разогреть масло и обжарить овощи. Добавить фарш и готовить 10–12 минут, разминая комочки лопаткой.\n" + "К фаршу с овощами добавить томатную пасту, размешать и прогреть 2 минуты.\n" +
                "Влить 0,5 стакана горячей воды, посолить и поперчить по вкусу, тушить 5 мин.\n" + "Во время приготовления соуса, отварить макароны согласно инструкции на упаковке. После добавить их в сковороду к фаршу, готовить все вместе 5 мин.\n" +
                "Перед подачей на стол можно посыпать тертым сыром и свежей зеленью.\n", R.drawable.pasta_navy));

        dishes.add(new Dish("Русская", "Щи", "Щи — это многокомпонентный заправочный суп, лицо русской кухни.\n", "Свинина (лопаточная или шейная часть) - 500 г.\n" + "Капуста белокочанная - 500 г.\n" + "Картофель - 2 шт.\n" +
                "Морковь - 1 шт.\n" + "Лук репчатый - 1-2 шт.\n" + "Томатная паста - 1 ст. ложка\n" + "или помидоры свежие - 2 шт.\n" + "Масло растительное - 2 ст. ложки.\n" + "Зелень - 0,5 пучка.\n" + "Лавровый лист - 1-2 шт.\n" + "Чеснок (по желанию) - 2-4 зубчика (по вкусу)\n"
                + "Перец молотый - 1 щепотка (по вкусу).\n" + "Соль - 0,5-1 ст. ложка (по вкусу).\n" + "Вода - 2-2,5 л.\n" + "Сметана (для подачи) - 100 г.\n",
                "1 час 20 мин\n", "Подготовить продукты.\n" + "Мясо вымыть, залить в кастрюле холодной водой. Поставить кастрюлю на огонь, довести воду до кипения, снять шумовкой пену.\n" +  "Уменьшить огонь до малого, накрыть кастрюлю крышкой. Варить бульон до готовности свинины (около часа). Отварное мясо затем можно вынуть, нарезать кусочками и добавить в суп.\n" +
                "Уменьшить огонь до малого, накрыть кастрюлю крышкой. Варить бульон до готовности свинины (около часа). Отварное мясо затем можно вынуть, нарезать кусочками и добавить в суп.\n" + "Пока варится мясо, подготовить овощи. Морковь очистить, натереть на крупной терке. Лук очистить и нарезать мелкими кубиками.\n" + "Разогреть сковороду, налить растительное масло. В горячее масло выложить лук и морковь. Обжаривать овощи на среднем огне (пассеровать) 2-3 минуты.\n" +
                "Добавить томатную пасту.\n" +
                "(Если используются свежие помидоры, нарезать их или натереть на тёрке и добавить к моркови с луком.)\n" + "Перемешать и готовить овощи еще 5-7 минут, помешивая.\n" + "Капусту нарезать квадратиками или соломкой.\n" + "Картофель почистить, нарезать небольшим кубиком (произвольными кусочками).\n" + "В бульон выложить капусту, картошку и довести до кипения.\n" +
                "(Вместе с картофелем добавлять только зрелую капусту, молодую капусту следует класть в суп минут за 7 до окончания приготовления.)\n" + "Добавить в суп зажарку (пассеровку). Варить щи из свежей капусты при слабом кипении 15-20 минут.\n" + "Зелень мелко нарезать.\n" + "Чеснок (если используется) почистить, раздавить с солью.\n" +
                "В конце приготовления супа добавить молотый перец, лавровый лист и, при желании, растертый чеснок с солью.\n" + "Добавить зелень и снять кастрюлю с огня. Дать супу настояться минут 10-15.\n", R.drawable.schi));

        dishes.add(new Dish("Русская", "Окрошка с картофелем и колбасой", "Традиционный рецепт летнего супа - окрошки.\n", "Кефир обезжиренный или сыворотка (или квас) - 2-2,5 л.\n" + "Сметана - 100 г.\n" + "Колбаса вареная или полукопчёная - 150 г.\n" + "Картофель отварной - 6 шт.\n" + "Яйца отварные - 3 шт.\n" + "Огурцы - 2-3 шт.\n" + "Лук зелёный - 1 пучок\n" + "Укроп свежий - 1 пучок\n"
                + "Соль - 1 ч. ложка\n", "50 мин\n", "Картофель хорошо вымыть. Поставить вариться картофель в мундире.\n" + "Поставить вариться яйца.\n" +
                "Пока они варятся, нарезать мелкими кубиками колбасу.\n" + "Вымыть и измельчить зеленый лук.\n" + "Вымыть и измельчить укроп.\n" + "Огурцы помыть и нарезать мелкими кубиками.\n" + "Сваренные яйца остудить в холодной воде, очистить. Затем мелко нарезать.\n" + "Сваренный картофель остудить в холодной воде, очистить и мелко нарезать.\n" + "Всё перемешать, посолить.\n" + "Добавить охлажденную сметану.\n" +
                "Всё залить холодным кефиром, сывороткой или несладким хлебным квасом. Если заливать окрошку с колбасой жирным кефиром, его следует разбавить холодной кипяченой водой.\n", R.drawable.okroshka));

        dishes.add(new Dish("Русская", "Котлеты с картофельным пюре", "Классика жанра!\n", "Картофель\n" + "Говядина\n" + "Свинина\n" + "Хлеб белый\n" + "Молоко\n" + "Сухари из белого хлеба\n" + "Огурцы соленые\n" + "Лук-шалот\n" + "Соль - по вкусу\n" + "Черный перец - по вкусу\n", "50 минут\n", "Картофель чистим, разрезаем на половинки и отвариваем в подсоленной воде.\n" + "С булки срезаем корки, выкладываем в миску, солим и заливаем небольшим количеством молока. Оставляем на время.\n" +
                "Лук, мясо, отжатую булку и 1 зубчик чеснока пропускаем через мясорубку.\n" + "Все перемешиваем, приправляем перцем и добавляем немного воды. Лепим котлеты и обваливаем их в панировочных сухарях.\n" + "В сковороде разогреваем растительное масло и обжариваем котлеты с двух сторон до готовности.\n" + "Нагреваем молоко, добавляем в него немного сливочного масла. Отваренный картофель измельчаем, соединяем с нагретым молоком и размешиваем.\n" + "Подаем котлеты с пюре и нарезанным соленым огурцом. Приятного аппетита!\n", R.drawable.meatballs_with_puree));

        dishes.add(new Dish("Русская", "Пирожки с мясом", "Невероятное тесто! Секрет вкуснейших домашних пирожков именно оно.\n", "Мука пшеничная - 500-550 г.\n" + "Молоко тёплое - 150 мл.\n" + "Вода тёплая - 150 мл\n" + "Масло растительное - 40 мл + для смазывания миски и противня.\n" + "Яйцо - 2 шт.\n" + "Дрожжи сухие быстродействующие - 7 г.\n" + "Сахар - 1 ст. ложка.\n" + "Соль - 2 ч. ложка.\n" + "Фарш мясной (говядина 70% + свинина 30%) - 500 г.\n" + "Лук репчатый - 1 шт..\n" + "Вода холодная - 50 мл\n" +
                "Перец молотый - по вкусу\n", "2 часа 20 мин\n", "Просеиваем в миску 400 г муки (оставшуюся затем будем добавлять частями, чтобы не забить тесто мукой). Добавляем к муке все сухие ингредиенты - дрожжи, сахар и соль. Перемешиваем.\n" + "В мучной смеси делаем углубление. Добавляем теплое молоко, теплую воду, яйцо, растительное масло. Перемешиваем сначала ложкой.\n" + "Добавляем еще просеянной муки и замешиваем тесто руками. Вымешиваем примерно минут 7. Не нужно забивать тесто мукой. Как только оно начинает отходить от чашки и от рук - тесто готово. \n" +
                " Чашку смазываем маслом, тесто собираем в шар, кладём в чашку и накрываем пленкой. Оставляем тесто в теплом месте для подъема, примерно на 1 час.\n" + "Готовим начинку: в чашке смешиваем фарш, мелко рубленный лук, соль, свежемолотый перец и немного холодной воды (чтобы начинка была сочной и мясо хорошо пропарилось!). Хорошо перемешиваем. Пока тесто понимается, убираем мясную начинку в холодильник.\n" + "Тесто увеличилось, стало воздушным и пористым.\n" +
                "Тесто обминаем, выкладываем на стол, посыпанный мукой. Делим на небольшие кусочки, слегка присыпаем мукой и скатываем их в шарики (примерно 16 штук). Накрываем салфеткой и даём тесту отдохнуть перед раскаткой минут 7-10.\n" + "Стол немного присыпаем мукой, каждый шарик раскатываем в лепешку.  На каждую лепешку выкладываем начинку, примерно по десертной ложке. Соединяем края и формируем пирожок.\n" + "Противень смазываем растительным маслом (можно застелить пергаментом для выпечки). Выкладываем пирожки с мясом на противень швом вниз, накрываем салфеткой и даем пирожкам отдохнуть ещё минут 10." +
                " Смазываем пирожки сверху яйцом, смешанным с молоком. Ставим в заранее разогретую духовку и выпекаем пирожки в духовке при 180-190 градусах примерно 30-35 минут.\n" + "Готовые пирожки с мясом выкладываем на блюдо, накрываем салфеткой, даём немного остыть и подаём.\n", R.drawable.pierogi));

        dishes.add(new Dish("Русская", "Драники классические", "Драники картофельные классические можно подать на завтрак, обед, ужин или в качестве перекуса.\n", "Картофель - 5 шт.\n" + "Лук - 0,5 шт.\n" + "Куриное яйцо - 1 шт.\n" + "Пшеничная мука - 2 ст. л.\n" + "Молотый черный перец - по вкусу.\n" + "Соль - по вкусу.\n" + "Растительное масло - по вкусу.\n", "30 мин\n",
                "Картофель необходимо в сыром виде очистить от кожуры, тщательно вымыть и натереть на мелкой терке. Для измельчения картофеля можно также воспользоваться блендером или перекрутить его через мясорубку. Аналогично нужно измельчить репчатый лук и добавить его к картофелю. В луково-картофельную смесь для связки добавляется сырое яйцо, а также специи по вкусу (в основном, черный молотый перец и соль) и мука. Тесто для драников тщательно замешивается до однородности.\n" +
                        "Сковорода с раскаленным маслом уже ожидает драников, поэтому с этого момента начинается сам процесс жарки. Тесто для драников нужно аккуратно, при помощи столовой ложки, выкладывать на сковородку в виде блинчиков. Размер драников зависит от предпочтений хозяйки. Они могут быть большими, тогда их в дальнейшем можно будет скрутить с разнообразной начинкой, трансформируя обыкновенные драники в фаршированную вкуснотищу. Драники могут быть и совсем маленькими, тогда их будет удобно подавать на небольших тарелках, к тому же, они наверняка понравятся малышам.\n" +
                        "Обжариваются драники на среднем огне с двух сторон до появления красивой румяной корочки, после чего сковородка накрывается крышкой, а блинчики прожариваются еще приблизительно три минуты на маленьком огне.\n", R.drawable.draniki));

        dishes.add(new Dish("Русская", "Оливье", "Салат Оливье занимает первое место практически у каждой хозяйки на праздничном столе.", "Картофель отварной (в мундире) - 400 г.\n" + "Морковь отварная (в мундире) - 150 г.\n" + "Яйца вареные - 6 шт.\n" + "Огурцы соленые - 300 г.\n" + "Колбаса вареная - 300 г.\n" + "Майонез - 300 мл.\n" + "Горошек зеленый консервированный - 1 банка.\n" + "Лук зеленый - 1 пучок (36 г).\n" + "Соль (по желанию) - по вкусу\n" + "Перец молотый (по желанию) - по вкусу\n", "40 мин\n", " Картофель отварить в кожуре, остудить, очистить, нарезать мелким кубиком.\n" +
                "Отварить морковь, остудить, очистить, нарезать мелкими кубиками.\n" + "Яйца отварить вкрутую, остудить, очистить, нарезать кубиками.\n" + "Огурцы очистить от кожицы, нарезать мелкими кубиками.\n" + "Зеленый лук измельчить.\n" + "Нарезать колбасу кубиками.\n" + "В миске смешать нарезанные овощи, зеленый горошек и майонез. Попробовать салат Оливье с колбасой на соль и досолить при необходимости по вкусу.\n", R.drawable.olive));

        dishes.add(new Dish("Русская", "Сельдь под шубой", "Хороший рыбный салат", "Свекла - 1 шт.\n" + "Морковь - 1 шт.\n" + "Куриное яйцо - 2 шт.\n" + "Майонез - по вкусу.\n" + "Лук - 0,4 шт.\n" + "Картофель - 1 шт.\n" + "Сельдь - 200 г.\n", "1 час\n", "Сварить свеклу, морковь, картошку и яйца.\n" + "Нарезать лук довольно мелко.\n" + "Отваренные овощи отчистить. Картошку и яйца пропустить через яйце резку. Свеклу и морковь натереть на терке.\n" + "Сельдь нарезать мелкими кусочками, убрав заранее кости.\n" + "Выкладываем на порционную тарелку сначала сельдь, потом лук, картофель, яйцо, морковь, свеклу.\n" +
                "Обмазать майонезом и в холодильник. Приятного аппетита!\n", R.drawable.seld_pod_shuboi));
    }
}