package com.example.cooking;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;

import java.util.ArrayList;
import java.util.List;

public class TaiActivity extends AppCompatActivity {

    List<Dish> dishes = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_tai);

        RecyclerView recyclerView = findViewById(R.id.list_dish);

        setInitialData();

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        DishAdapter adapter = new DishAdapter(this, TaiActivity.this, dishes);
        recyclerView.setAdapter(adapter);


        findViewById(R.id.buttonBack).setOnClickListener(v -> {
            startActivity(new Intent(TaiActivity.this, MainActivity.class));
            finish();
        });
    }

    private void setInitialData() {

        dishes.add(new Dish("Тайская", "Свинина в апельсиновой глазури", "Традиционный рецепт летнего супа - окрошки.\n", "Свинина - 1 кг.\n" + "Апельсины - 1 штука.\n" + "Соевый соус - 2 столовые ложки.\n" + "Тертый имбирь - 1 столовая ложка.\n" + "Мёд - 2 столовые ложки.\n",
                "1ч. 30 мин\n", "Мясо вымыть, обсушить, натереть солью и перцем, и обмазать со всех сторон растительным маслом. Положить мясо на смазанный маслом противень.\n" + "Запекать в духовке при температуре 180 градусов 60–70 минут.\n" +
                "Приготовить апельсиновый сироп. Для этого апельсин вымыть и обсушить. При помощи мелкой терки с половины или с третьей части апельсина снять цедру. Затем разрезать апельсин пополам, и из обеих половинок выжать сок.\n" + "Очистить корень имбиря и натереть его на мелкой терке. В миске соединить апельсиновый сок, цедру, имбирь, соевый соус и мед. Все хорошо перемешать и поставить на сильный огонь. Варить сироп, помешивая, до загустения.\n" + "Вынуть мясо из духовки, обмазать его сиропом и запекать еще 5–10 минут. За это время мясо можно еще 1–2 раза смазать сиропом.\n" + "Готовую свинину выложить на листья салата и украсить кружками апельсинов.\n" + "Сваренные яйца остудить в холодной воде, очистить. Затем мелко нарезать.\n",
                R.drawable.svinina));



        dishes.add(new Dish("Тайская", "Липкий рис с манго", "Традиционный тайский липкий рис с манго. Абсолютно вегетарианский десерт.\n", "Жасминовый рич - 175 г.\n" + "Кокосовое молоко - 250 мл.\n" + "Сахар - 2 ст. л.\n" + "Соль - щепотка.\n" + "Тайское манго - 1 штука.\n" + "Черные кунжутные семечки - по вкусу.\n", "30 мин\n", "Замочить рис на несколько часов, а лучше на ночь.\n" + "Затем слить воду, завернуть рис в марлю и положить в пароварку. Варить до готовности — 20-25 минут.\n" +
                "Кокосовое молоко поставить на слабый огонь, добавить сахар, соль и дать им раствориться.\n" + "Готовый рис переложить в миску, дать ему немного остыть. Затем понемногу добавлять кокосовое молоко и перемешивать.\n" + "Очистить и аккуратно нарезать манго тонкими ломтиками, не превратив его в пюре.\n" + "Огурцы помыть и нарезать мелкими кубиками.\n" + "Подавать рис с манго, посыпав черным кунжутом.\n" + "Сваренный картофель остудить в холодной воде, очистить и мелко нарезать.\n",
                R.drawable.rissmango));





        dishes.add(new Dish("Тайская", "Пури", "Пури - это индийские жареные лепешки, которые готовятся из пресного теста.\n", "Мука пшеничная - 1 стакан.\n" + "Вода тёплая - 0.5 стакана.\n" + "Соль - 0,5 ч.л.\n" + "Масло топлёное - 2 ч.л. .\n" + "Масло растительное рафинированное - 1 стакан.\n",
                "50 мин\n", "В подходящей миске смешиваем теплую воду с солью.\n" + "Добавляем просеянную муку и начинаем замешивать тесто.\n" +
                "В получившейся массе в центре делаем небольшое углубление. В это углубление добавляем подогретое топленое масло.\n" + "Замешиваем эластичное тесто. Сразу его не используем, а накрываем тесто для лепешек полотенцем и даем ему отдохнуть минут 20 при комнатной температуре.\n" + "Отдохнувшее тесто делим на 6 комочков.\n" + "Каждый комочек теста раскатываем в тонкую лепешку.\n" +
                "Вливаем на сковороду растительное масло. Хорошо разогреваем его. Выкладываем для обжарки лепешку в масло так, чтобы она плавала в нем.\n" + "С каждой стороны жарим лепешку пури по 20 секунд.\n" +
                "Чтобы избавиться от излишков масла, готовые лепешки пури перекладываем после жарки на бумажное полотенце.\n" +
                "Индийские лепешки пури готовы! Подаем их к столу в горячем виде.\n",
                R.drawable.puri));




        dishes.add(new Dish("Тайская", "Чатни из крыжовника с зелёным яблоком (на зиму)", "Чатни - это индийский соус с неоднородной структурой и сложным богатым вкусом.\n", "Крыжовник - 450 г.\n" + "Яблоко зелёное(кислое) - 230 г.\n" + "Лук репчатый - 130 г.\n" + "Чеснок - 1 зубок.\n" + "Карри - 0,5 ч.л.\n" + "Паприка копчёная молотая - 0,5 ч.л.\n" + "Перец чёрный молотый - 0,5 ч.л.\n" + "Уксус белый винный (5%) - 100 мл.\n"
                + "Сахар - 90 г.\n" + "Соль - 0,5 ч.л.", "1 ч. 30 мин.\n", "Подготовьте необходимые продукты.\n" + "Крыжовник необходимо промыть, у каждой ягоды с обоих концов срезать ножницами хвостик и плодоножку. Ягоды ещё раз промойте и откиньте на дуршлаг.\n" +
                "Лук и чеснок очистите и измельчите ножом. Мелко нарезанные лук и чеснок выложите в кастрюлю с толстым дном. Добавьте 2-3 столовые ложки воды. Кастрюлю поставьте на нагрев, накройте крышкой и после закипания воды тушите овощи на небольшом огне 10 минут.\n" + "Яблоко вымойте и разрежьте на 4 части. Ножом удалите сердцевину с семечками и снимите кожицу. Очищенное яблоко нарежьте небольшими ломтиками.\n" + "Кастрюлю накройте крышкой, верните на огонь и начните нагревать на небольшом огне. Затем по мере выделения сока увеличивайте огонь до среднего.После закипания тушите содержимое кастрюли около 45 минут. Яблоко и крыжовник должны стать мягкими.Разомните чатни толкушкой.\n" + "В кастрюлю с тушеным луком всыпьте очищенный крыжовник и ломтики яблока.\n" + "Добавьте соль, сахар, уксус, карри, копчёную паприку и чёрный перец. Перемешайте. Доведите массу до кипения, помешивая. Попробуйте чатни и при необходимости\n" +
                "Подготовьте банки и крышки: банки тщательно вымойте с пищевой содой и промойте. На дно кастрюли поместите крышки для консервации и установите металлическую решётку. Поставьте банки на решётку горлышками вниз. В кастрюлю налейте воду, чтобы она закрывала часть горлышек банок. Поставьте кастрюлю на огонь и после закипания воды стерилизуйте крышки и банки 10-15 минут. Затем поместите простерилизованные крышки и банки на чистое кухонное полотенце.\n" + "По горячим банкам разложите кипящий чатни. Из указанного количества продуктов у меня получилось 2 баночки объёмом по 350 мл и еще немного осталось на пробу.\n" +
                "Баночки с чатни плотно укупорьте стерильными крышками и переверните верх донышками. Укутайте банки в тёплое одеяло или шерстяной платок и оставьте до остывания. После полного остывания банок отправьте чатни из крыжовника с зелёным яблоком в сухое прохладное место на хранение.\n" + "Чатни обогащает нейтральные по вкусу гарниры, например рис. Хорошо подавать чатни к блюдам из картофеля. Приятного аппетита!",
                R.drawable.chatni));
    }
}