package com.example.cooking;

import androidx.appcompat.app.AppCompatActivity;
import androidx.recyclerview.widget.LinearLayoutManager;
import androidx.recyclerview.widget.RecyclerView;

import android.content.Intent;
import android.os.Bundle;
import android.view.View;

import java.util.ArrayList;
import java.util.List;

public class TurkishActivity extends AppCompatActivity {

    List<Dish> dishes = new ArrayList<>();

    @Override
    protected void onCreate(Bundle savedInstanceState) {
        super.onCreate(savedInstanceState);
        setContentView(R.layout.activity_turkish);

        RecyclerView recyclerView = findViewById(R.id.list_dish);

        setInitialData();

        recyclerView.setLayoutManager(new LinearLayoutManager(this));
        DishAdapter adapter = new DishAdapter(this, TurkishActivity.this, dishes);
        recyclerView.setAdapter(adapter);


        findViewById(R.id.buttonBack).setOnClickListener(v -> {
            startActivity(new Intent(TurkishActivity.this, MainActivity.class));
            finish();
        });
    }

    private void setInitialData() {

        dishes.add(new Dish("Турецкая", "Кёфте", "Мясные тефтельки, которые в Турции — кёфте, в Азербайджане — кюфта, а в других странах Средиземноморья и Ближнего Востока называются по-разному, но тоже похоже, популярны и как домашняя еда, и как стрит-фуд.\n", "Помидоры - 1 шт.\n" + "Говяжий фарш - 100 г.\n" + "Армянский лаваш - 1 шт.\n" + "Латук - 1 головка.\n" + "Сыр сулугуни - 1 кусок.\n" + "Зеленый салат - 2 стебля.\n" + "Красный перец чили - 1 штука.\n" + "Кумин (зира) - по вкусу.\n" + "Соль - по вкусу.\n" + "Молотый черный перец - по вкусу.\n", "10 минут", "Для фарша используют только халяльную говядину, причем фарш крутят сами — с филе нужно срезать жир и внимательно удалить прожилки. Затем мясо пропустить через мясорубку и смешать с бараньим курдюком, солью, зирой и другими специями по вкусу. Из фарша нужно сформировать небольшие котлетки и обжаривать на гриле около четырех минут.\n" +
                "Помидоры — бакинские или узбекские — нужно нарезать толстыми кружочками, белый салатный латук — полукольцами, перец чили измельчить. От лука и перца можно отказаться, а можно положить больше, как кому нравится. Листья салата нарезать широкой лапшой.\n" + "Лепешки сулугуни нужно чуть-чуть поджарить на гриле, чтобы сыр стал мягче. Брать соленый или пресный — личное дело каждого. Лаваш тоже нужно немного подсушить, а потом подрезать по краям, чтобы получился ровный прямоугольник.\n" + "Лаваш сложить пополам и на него поочередно выложить салат, три котлетки, перец чили, помидоры, лук и сыр. Затем свернуть, подогнуть снизу и крепко завернуть в бумагу, чтобы не развалилось в руках.\n" +
                "Для большей скорости можно сначала нарезать овощи, а потом уже жарить котлетки — они должны быть горячими, чтобы сыр оставался немного подтаявшим.\n", R.drawable.kefte));

        dishes.add(new Dish("Турецкая", "Турецкая пицца пиде", "Турецкие пиде отличаются от итальянской пиццы вытянутой формой и, как и пицца, готовятся в печи. В нашем рецепте традиционная версия начинки — бараний фарш, помидоры, перец, лук и зелень, хотя иногда пиде готовят с сыром и яйцами, как хачапури.", "Пшеничная мука - 510 г.\n" + "Сухие дрожжи - 10 г.\n" + "Растительное масло - 25 мл.\n" + "Вода - 240 мл.\n" + "Петрушка - 40 г.\n" + "Чеснок - 20 г.\n" + "Бараний фарщ - 700 г.\n" + "Перец чили - 1 шт.\n" + "Сладкий перец - 200 г.\n" + "Репчатый лук - 180 г.\n" + "Кумин (зира) - 2 ч. л.\n" + "Перец чили хлопьями - 1 ч. л.\n" + "Томатная паста - 40 г.\n" + "Оливковое масло - 50 мл.\n" + "Соль - по вкусу.\n" + "Молотый черный перец - по вкусу.\n" + "Сахар - по вкусу.\n", "2 часа\n",
                "Смешать миксером муку, дрожжи, по 5 грамм соли и сахара, 25 мл растительного масла и теплую воду. Замесить однородное тесто. Переложить его в смазанную маслом чашу, накрыть и убрать в теплое место на 40–60 минут.\n" + "На сковороде обжарить измельченный лук до мягкости вместе с зирой, затем добавить мелко нарезанные перцы и чеснок, обжаривать 2 минуты, после чего добавить фарш и жарить 10–15 минут. Добавить томатную пасту, черный перец, хлопья чили, сахар и соль по вкусу, жарить еще 2–3 минуты. Затем снять с огня и добавить в фарш половину рубленой петрушки.\n" + "Расстоявшееся тесто обмять и разделить на равные части. Раскатать кусок теста в длинный тонкий пласт, переложить его на противень с пекарской бумагой. Выложить на тесто восьмую часть фарша тонким слоем, отступая от краев на 2–3 см. Подогнуть края теста, а концы пиде слепить так, чтобы получился пирог в форме длинной лодочки. Смазать тесто оливковым маслом и отправить пиде в духовку, разогретую до 180 градусов, на 15–20 минут, пока тесто не подрумянится.\n" +
                        "Готовые пиде посыпать петрушкой и разрезать поперек, подавать горячими.\n", R.drawable.t_pizza));

        dishes.add(new Dish("Турецкая", "Гезлеме", "Можно есть горячими и холодными. Также можно сделать к ним соус. Соус: натурального йогурта 200 мл, укроп, чеснок по вкусу.\n", "Пшеничная мука - 600 г.\n" + "Вода - 300 мл.\n" + "Соль - 0,5 ч. л.\n" + "Сыр - 300 г.\n" + "Растительное масло - 2 ст. л.\n" + "Зелень - 100 г.\n", "30 мин\n", "Замесить тесто: муку смешать с солью, хорошо смешать с водой. Получиться мягкое, эластичное тесто. На стол налить немного масла и замесить тесто, разделить на 6–8 частей. Взять 1 часть теста и раскатать на столе (полить немного маслом) очень-очень тонко, 1–2 мл, чтобы просвечивалось.\n" +
                "Приготовить начинку: натереть сыр на терке, зелень мелко порезать, перемешать. Также можно использовать разные варианты начинки: творог+зелень, фарш, яйцо+зелень.\n" + "На половину тесто выложить начинку, разровнять, сверху накрыть второй половиной, чуть прилепить края. В форме пельменя, но такого размера, чтобы влезал на сковороду.\n" + "Сковороду (лучше всего чугунную) хорошенько разогреть, огонь убавить до среднего. Выложить подготовленную гезлеме на сковороду. Жарить минуту-две, перевернуть, жарить минуту, перевернуть… и т. д. Иными словами, гезлеме нужно перевернуть несколько раз, пока не будет готово. Жарить до золотисто-коричневой корочки.\n" + "Сняв со сковороды на доску, сбрызнуть маслом, сложить пополам, дать пропитаться пол минуты и разложить обратно. Перевернуть и — также с другой стороны. Нарезать на небольшие квадратики.\n", R.drawable.gezleme));

        dishes.add(new Dish("Турецкая", "Шашлык из маринованной говядины", "Рецепт по-азиатски", "Филейная вырезка - 450 г.\n" + "Зеленый лук - 6 стеблей.\n" + "Коричневый сахар - 0,5 стакана.\n" + "Шерри - 3 ст. л.\n" + "Соевый соус - 3 ст. л.\n" + "Кунжутное масло - 2 ч. л.\n" + "Чеснок - 2 зубчика.\n" + "Молотый имбирь - 0,5 ч. л.\n", "25 мин\n", "Порежьте мясо на тонкие полоски.\n" + "Смешайте сахар, шерри, соевый соус, кунжутное масло, измельченный чеснок и имбирь. В пластиковый пакет вылейте половину маринада и положите мясо. Хорошо перемешайте и отправьте на 20 минут в холодильник. Сохраните оставшийся маринад.\n" + "Тем временем, замочите 16 бамбуковых палочек в воде на 10 минут. Просушите.\n" +
                "Выньте мясо из маринада и, чередуя с луком, наденьте на палочки.\n" + "Разогрейте гриль и жарьте мясо по 5-6 минут, перевернув 1 раз. Смазывайте во время жарки оставленным маринадом.\n", R.drawable.shashlik));

        dishes.add(new Dish("Турецкая", "Турецкая пахлава", "Заливать пахлаву можно прямо на противне (если она лежит довольно плотно) или можно переложить в другую емкость, чтобы добиться более плотной укладки.\n", "Пшеничная мука - 500 г.\n" + "Куриное яйцо - 1 шт.\n" + "Молоко - 1 стакан.\n" + "Соль - щепотка.\n" + "Сливочное масло - 250 г.\n" + "Грецкие орехи - 300 г.\n" + "Сахарная пудра - 300 г.\n" + "Корица - 0,5 ч. л.\n" + "Сахар - 1 стакан.\n" + "Вода - 1 стакан.\n" + "Мед - 1 ст. л.\n", "2 часа 30 минут\n", "Просейте необходимое по рецепту количество муки в миску. Добавьте щепотку соли, перемешайте. Сделайте в центре мучной горки лунку и добавьте туда все жидкие компоненты теста: теплое молоко, яйцо, растопленное сливочное масло (50 г).\n" + "При помощи вилочки, подсыпая муку с краев лунки в центр, начните замешивать тесто. Вам нужно добиться того, чтобы в тесто вошла вся отмеренная в миске мука и при этом оно получилось достаточно мягким, эластичным и не липким. Если вы чувствуете, что в процессе замеса тесту явно не хватает жидкости, оно получается сухое и не может вобрать всю муку, добавляйте небольшими порциями теплое молоко.\n" +
                "Замешанное тесто выложите на подпыленную мукой доску и тщательно вымесите в течение 7 — 10 минут до тех пор, пока тесто не перестанет липнуть к рукам и доске. Вымешанное тесто положите в пакет и оставьте как минимум на 30 минут для отдыха.\n" + "Для начинки вам понадобится измельчить орехи кусочками. Перемолотые орехи смешайте с сахарной пудрой и корицей.\n" + "Отдохнувшее тесто разделите на кусочки величиной с шарик для пинг-понга (23 кусочка).\n" + "Накройте разделенное тесто полотенцем, чтобы оно не сохло. Возьмите один кусочек и раскатайте его как можно тоньше в круг. Раскатанное тесто смажьте очень размягченным, сливочным маслом. Посыпьте на тесто начинку.\n" + "При помощи тонкой палочки (китайской например) сверните тесто в рулет. Соберите свернутое тесто в гармошку, снимите с палочки и заправьте внутрь кончики. Таким же образом раскатайте, просыпьте начинкой и сверните все оставшееся тесто. Сделанные кусочки пахлавы выкладываем на застеленный пергаментом противень и накрываем сделанные кусочки полотенцем, чтоб не сохли.\n" + "Когда все кусочки готовы, смазываем их яичным желтком, взболтанным со столовой ложкой воды и ставим в разогретую до 200 С духовку на 10–15 минут. Убавьте температуру в духовке до 160–170 С, достаньте противень, обильно смажьте пахлаву растопленным сливочным маслом, верните противень в духовку и выпекайте примерно 50–60 минут до полной золотистости — готовности.\n" +
                "В это время готовим сахарный сироп. Для сахарного сиропа добавьте в горячую воду нужное количество сахара и столовую ложку меда и при нагревании добейтесь полного растворения сахара. Доведите раствор до кипения и поварите при слабом кипении около 15 минут.\n" + "Горячую пахлаву залейте сахарным сиропом и оставьте при комнатной температуре на 5– 6 часов накрыв пахлаву пленкой.\n", R.drawable.pahlava));
    }
}